Repository: yben27/emacslispref
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: fr_fr

source: The flag @samp{#} specifies an ``alternate form'' which depends on the format in use. For @samp{%o} it ensures that the result begins with a @samp{0}. For @samp{%x} and @samp{%X}, it prefixes the result with @samp{0x} or @samp{0X}. For @samp{%e}, @samp{%f}, and @samp{%g}, the @samp{#} flag means include a decimal point even if the precision is zero.
fr_fr: L’indicateur @samp{#} spécifie une "forme secondaire " qui dépend du format utilisé. Pour @samp{%o} il fait en sorte/garantit que le résultat commence par @samp{0}. Pour @samp{%x} et @samp{%X}, il place devant le résultat/il met en préfixe devant le résultat @samp{0x} ou @samp{0X}. Pour @samp{%e}, @samp{%f}, et @samp{%g}, le indicateur @samp{#} signifie l'inclusion d'un point décimal même si la précision est égale à zéro.

source: The following diagram shows the relationship between these types:
fr_fr: Le schéma suivant montre les relations entre ces types :

source: The following functions create strings, either from scratch, or by putting strings together, or by taking them apart.
fr_fr: Les fonctions suivantes permettent de créer des chaînes, soit en partant de zéro, soit en réunissant des chaînes, ou en les désassemblant.

source: The following three functions are convenient subroutines for packages that define non-@acronym{ASCII} character sets. They modify the specified case table @var{case-table}; they also modify the standard syntax table. @xref{Syntax Tables}. Normally you would use these functions to change the standard case table.
fr_fr: Les trois fonctions suivantes sont des sous-routines pratiques pour les paquetages qui définissent des ensembles de caractères non @acronym{ASCII}. Elles modifient le tableau de casse spécifié @var{case-table} ; elles modifient également le tableau de syntaxe standard. @xref{Syntax Tables}. Normalement, il faut utiliser ces fonctions pour changer le tableau de casse standard.

source: The following two variables have existed since Emacs version 19.23:
fr_fr: Les deux variables suivantes existent depuis la version 19.23 d'Emacs :

source: The format we use for buffer contents in examples.
fr_fr: Le format que nous employons pour le contenu de tampons dans les exemples.

source: The format we use for examples of errors.
fr_fr: Le format que nous employons pour des exemples d'erreurs.

source: The format we use for examples of evaluation.
fr_fr: Le format que nous employons pour des exemples de l'évaluation.

source: The format we use when examples print text.
fr_fr: Le format que nous employons quand les exemples affichent du texte.

source: The four functions @code{symbol-name}, @code{symbol-value}, @code{symbol-plist}, and @code{symbol-function} return the contents of the four cells of a symbol. Here as an example we show the contents of the four cells of the symbol @code{buffer-file-name}:
fr_fr: Les quatre fonctions @code{symbol-name}, @code{symbol-value}, @code{symbol-plist} et @code{symbol-function} retournent les contenus des quatre cellules d'un symbole. Ici par exemple, on montre les contenus des quatre cellules du symbole @code{butter-file-name} :

source: The function @code{foo} subtracts @var{integer1} from @var{integer2}, then adds all the rest of the arguments to the result. If @var{integer2} is not supplied, then the number 19 is used by default.
fr_fr: La fonction @code{foo} soustrait @var{integer1} de @var{integer2}, puis ajoute tout reste des arguments au résultat. Si @var{integer2} n'est pas fourni, alors le numéro 19 est appliqué par défaut.

source: The function @code{lsh}, like all Emacs Lisp arithmetic functions, does not check for overflow, so shifting left can discard significant bits and change the sign of the number. For example, left shifting 268,435,455 produces @minus{}2 on a 29-bit machine:
fr_fr: La fonction @code{lsh}, comme toutes les fonctions arithmétiques d'Emacs Lisp, ne vérifie pas le débordement, ainsi de décalage à gauche peut changer le bit fort et changer le signe du nombre. Par exemple, le décalage à gauche de 268.435.455 produit @minus{}2 sur une machine de 29 bits :

source: The function @code{string=} ignores the text properties of the two strings. When @code{equal} (@pxref{Equality Predicates}) compares two strings, it uses @code{string=}.
fr_fr: La fonction @code{string=} ignore les propriétés textuelles des deux chaînes. Quand @code{equal} (voir la section @pxref{Equality Predicates}) compare deux chaînes, il utilise @code{string=}.

source: The function @var{hash-fn} should accept one argument, a key, and return an integer that is the ``hash code'' of that key. For good results, the function should use the whole range of integer values for hash codes, including negative integers.
fr_fr: La fonction @var{hash-fn} doit prendre un argument, une clé, et elle retourne un entier relatif qui est le ``code de hachage'' de cette clé. Pour obtenir de bons résultats, la fonction doit utiliser tout l'ensemble des entiers relatifs pour les valeurs des codes de hachage, y compris les entiers négatifs.

source: The function @var{test-fn} should accept two arguments, two keys, and return non-@code{nil} if they are considered ``the same.''
fr_fr: La fonction @var{test-fn} doit prendre deux arguments, deux clés, et elle retourne non-@code{nil} s'ils sont considérés comme ``identiques''.

source: The function cell or the value cell may be @dfn{void}, which means that the cell does not reference any object. (This is not the same thing as holding the symbol @code{void}, nor the same as holding the symbol @code{nil}.) Examining a function or value cell that is void results in an error, such as @samp{Symbol's value as variable is void}.
fr_fr: La cellule de fonction ou cellule de valeur peut être @dfn{void}, ce qui signifie que la cellule ne référence aucun objet. (Cela n'est pas comme contenir le symbole @code{void} ou le symbole @code{nil}.) Interroger une cellule de fonction ou de valeur qui est void résulte en une erreur, comme @samp{Symbol's value as variable is void}.

source: The functions @code{ffloor}, @code{fceiling}, @code{fround}, and @code{ftruncate} take a floating point argument and return a floating point result whose value is a nearby integer. @code{ffloor} returns the nearest integer below; @code{fceiling}, the nearest integer above; @code{ftruncate}, the nearest integer in the direction towards zero; @code{fround}, the nearest integer.
fr_fr: Les fonctions @code{ffloor}, @code{fceiling}, @code{fround}, et @code{ftruncate} prennent un argument à virgule flottante et renvoient un monbre à virgule flottante représentant la valeur d'un nombre entier voisin. @code{ffloor} renvoie le nombre entier le plus proche inférieur ; @code{fceiling}, le nombre entier le plus proche supérieur ; @code{ftruncate}, le nombre entier le plus proche de zéro ; @code{fround}, le nombre entier le plus proche.

source: The functions in this section test for numbers, or for a specific type of number. The functions @code{integerp} and @code{floatp} can take any type of Lisp object as argument (they would not be of much use otherwise), but the @code{zerop} predicate requires a number as its argument. See also @code{integer-or-marker-p} and @code{number-or-marker-p}, in @ref{Predicates on Markers}.
fr_fr: Les fonctions dans cette section testent les nombres, ou un type spécifique de nombre. Les fonctions @code{integerp} et @code{floatp} peuvent prendre n'importe quel type d'objet de Lisp comme argument (ils ne seraient pas utiles autrement), mais l'attribut @code{zerop} exige un nombre en tant qu'argument. Voir également @code{integer-or-marker-p} et @code{number-ou-marker-p}, dans le @ref{Predicates on Markers}.

source: The general sequence functions @code{copy-sequence} and @code{length} are often useful for objects known to be arrays. @xref{Sequence Functions}.
fr_fr: Les fonctions générales sur les suites, @code{copy-sequence} et @code{length}, sont souvent utiles pour les objets de type tableaux. @xref{Sequence Functions}.

source: The integer @minus{}1 looks like this:
fr_fr: Le nombre entier @minus{}1 ressemble à ceci:

source: The keyword @code{&rest} (which must be followed by a single argument name) indicates that any number of arguments can follow. The single argument name following @code{&rest} will receive, as its value, a list of all the remaining arguments passed to the function. Do not write @code{&rest} when you call the function.
fr_fr: Le mot-clé @code{&rest} (qui doit être suivi d'un nom d'argument simple) indique qu'un certain nombre d'arguments va suivre. Le nom d'argument simple suivant @code{&rest} recevra, comme valeur, une liste de tous arguments restants à passer à la fonction. Ne pas écrire @code{&rest} quand vous appelez la fonction.

source: The length of a string (like any array) is fixed, and cannot be altered once the string exists. Strings in Lisp are @emph{not} terminated by a distinguished character code. (By contrast, strings in C are terminated by a character with @acronym{ASCII} code 0.)
fr_fr: La longueur d’une chaîne de caractères (comme tout tableau) est fixe et ne peut pas être modifiée une fois la chaîne créée. Dans le langage Lisp, les chaînes @emph{ne} se terminent @emph{pas} par un code de caractère distinctif. (Contrairement aux chaînes de caractères en C qui se terminent par un caractère de code @acronym{ASCII} 0.)

source: The length of the array is fixed once you create it; you cannot change the length of an existing array.
fr_fr: La longueur d'un tableau est fixe une fois qu'il a été créé. On ne peut pas changer la longueur d'un tableau existant.

source: The major version number of Emacs, as an integer. For Emacs version 20.3, the value is 20.
fr_fr: Le numéro principal de version d'Emacs, comme nombre entier. Pour la version 20.3 d'Emacs, la valeur est 20.

source: The manual should be fully correct in what it does cover, and it is therefore open to criticism on anything it says---from specific examples and descriptive text, to the ordering of chapters and sections. If something is confusing, or you find that you have to look at the sources or experiment to learn something not covered in the manual, then perhaps the manual should be fixed. Please let us know.
fr_fr: Le manuel devrait être entièrement correct dans ce qu'il couvre, et il est donc soumis à la critique sur tout ce qu'il indique---des exemples spécifiques et du texte descriptif, à l'ordre des chapitres et des sections---. Si quelque chose est peu clair, ou si vous constatez que vous devez regarder les sources ou expérimenter pour apprendre quelque chose non couvert dans le manuel, alors peut-être faudrait-il l'inclure dans le manuel. Merci de nous faire le savoir.

source: The minor version number of Emacs, as an integer. For Emacs version 20.3, the value is 3.
fr_fr: Le numéro de version mineur d'Emacs, comme nombre entier. Pour la version 20.3 d'Emacs, la valeur est 3.

source: The most basic way to alter the contents of an existing string is with @code{aset} (@pxref{Array Functions}). @code{(aset @var{string} @var{idx} @var{char})} stores @var{char} into @var{string} at index @var{idx}. Each character occupies one or more bytes, and if @var{char} needs a different number of bytes from the character already present at that index, @code{aset} signals an error.
fr_fr: Le moyen le plus simple pour modifier le contenu d'une chaîne existante est d'utiliser @code{aset} (voir la section @pxref{Functions that Operate on Arrays}). @code{(aset @var{string} @var{idx} @var{char}) stocke @var{char} dans @var{string} à l'indice @var{idx}. Chaque caractère occupe un ou plusieurs octets, et si @var{char} a besoin d'un nombre d'octets différent de celui du caractère déjà présent à cet indice, @code{aset} soulève une erreur.

source: The negative integer, @minus{}5, is creating by subtracting 4 from @minus{}1. In binary, the decimal integer 4 is 100. Consequently, @minus{}5 looks like this:
fr_fr: Le nombre entier négatif, @minus{}5, est créé en soustrayant 4 de @minus{}1. Dans la base binaire, le nombre entier décimal 4 est 100. En conséquence, @minus{}5 ressemble à ceci:

source: The parsing skips spaces and tabs at the beginning of @var{string}, then reads as much of @var{string} as it can interpret as a number in the given base. (On some systems it ignores other whitespace at the beginning, not just spaces and tabs.) If the first character after the ignored whitespace is neither a digit in the given base, nor a plus or minus sign, nor the leading dot of a floating point number, this function returns 0.
fr_fr: L'analyse syntaxique ignore les espaces et les tabulations au début de @var{string}, puis lit @var{string} tant que elle peut l'interpréter comme un nombre dans la base donnée. (Sur certains systèmes, elle ignore les autres blancs au début, pas seulement les espaces et les tabulations.) Si le premier caractère après le "whitespace" ignoré n'est ni un chiffre dans la base donnée, ni un signe plus ou moins, ni le premier point d'un "float", cette fonction retourne 0.

source: The principal function for creating a hash table is @code{make-hash-table}.
fr_fr: La fonction principale pour créer une table de hachage est @code{make-hash-table}.

source: The print name cell always holds a string, and cannot be changed. The other three cells can be set individually to any specified Lisp object.
fr_fr: La cellule du nom d'affichage contient toujours une chaîne de caractères et ne peut pas être changée. Les trois autres cellules peuvent être assignées individuellement à n'importe quel objet Lisp.

source: The print name cell holds the string that is the name of the symbol. Since symbols are represented textually by their names, it is important not to have two symbols with the same name. The Lisp reader ensures this: every time it reads a symbol, it looks for an existing symbol with the specified name before it creates a new one. (In GNU Emacs Lisp, this lookup uses a hashing algorithm and an obarray; see @ref{Creating Symbols}.)
fr_fr: La cellule du nom d'affichage contient la chaîne de caractère qui est le nom du symbole. Comme les symboles sont représentés textuellement par leurs noms, il est important de ne pas avoir deux symboles avec le même nom. Le lecteur Lisp s'assure de ceci : à chaque fois qu'il lit un symbole, il regarde s'il existe déjà un symbole avec le même nom avant de créer le nouveau. (Dans GNU Emacs Lisp, cette recherche utilise un algorithme de hachage et un obarray ; voir @ref{Creating Symbols}.)

source: The property list cell normally should hold a correctly formatted property list (@pxref{Property Lists}), as a number of functions expect to see a property list there.
fr_fr: Normalement, il faut que la cellule de liste de propriétés contienne une liste de propriétés correctement formatée (@pxref{Property Lists}) vu qu'un certain nombre de fonctions s'attendent à voir une liste de propriétés à cet endroit.

source: The range of values for an integer depends on the machine. The minimum range is @minus{}268435456 to 268435455 (29 bits; i.e.,
fr_fr: Le champ des valeurs pour un nombre entier dépend de la machine. Le champ minimum est @minus{}268435456 à 268435455 (29 bits; c.-à-d.,

source: The read-syntax for floating point numbers requires either a decimal point (with at least one digit following), an exponent, or both. For example, @samp{1500.0}, @samp{15e2}, @samp{15.0e2}, @samp{1.5e3}, and @samp{.15e4} are five ways of writing a floating point number whose value is 1500. They are all equivalent. You can also use a minus sign to write negative floating point numbers, as in @samp{-1.0}.
fr_fr: La syntaxe de lecture pour des nombres à virgule flottante exige une virgule décimale (avec au moins un chiffre suivant), un exposant, ou les deux. Par exemple, @samp{1500.0}, @samp{15e2}, @samp{15.0e2}, @samp{1.5e3}, et @samp{.15e4} sont cinq manières d'écrire le nombre à virgule flottante dont la valeur est 1500. Ils sont tous équivalents. Vous pouvez également employer un signe moins pour écrire des nombres négatifs à virgule flottante, comme dans @samp{- 1.0}.

source: The result is not @code{("" "two" "words" "")}, which would rarely be useful. If you need such a result, use an explicit value for @var{separators}:
fr_fr: Le résultat n'est pas @code{("" "deux" "mots" "")}, qui serait rarement utile. Si vous voulez un tel résultat, utilisez une valeur explicite pour @var{separators} :

source: The return value is always @code{nil}; to make this function useful, @var{function} should have side effects. For example, here is how to examine each element of the syntax table:
fr_fr: La valeur en retour est toujours @code{nil} ; pour rendre cette fonction utile, @var{function} devrait avoir des effets secondaires. Par exemple, voici comment examiner chaque élément de la table de syntaxe :

source: The set of abbrevs currently in effect is recorded in an @dfn{abbrev table}. Each buffer has a local abbrev table, but normally all buffers in the same major mode share one abbrev table. There is also a global abbrev table. Normally both are used.
fr_fr: Actuellement, l'ensemble des abréviations est enregistré dans un @dfn{abbrev table}. Chaque tampon a une table locale d'abréviations, mais normalement tous les tampons dans le même mode majeur partage une table principale d'abréviations. Il y a donc une table d'abréviation globale. Normalement toutes les deux sont employées.

source: The specified functions are stored in the property list of @var{name} under the property @code{hash-table-test}; the property value's form is @code{(@var{test-fn} @var{hash-fn})}.
fr_fr: Les fonctions spécifiées sont stockées dans la liste de propriétés de @var{name} sous la propriété @code{hash-table-test} ; la forme de la propriété de la valeur est @code{(@var{test-fn} @var{hash-fn})}.

source: The strings are both converted to multibyte for the comparison (@pxref{Text Representations}) so that a unibyte string and its conversion to multibyte are always regarded as equal. If @var{ignore-case} is non-@code{nil}, then case is ignored, so that upper case letters can be equal to lower case letters.
fr_fr: Les deux chaînes sont converties en multi-octet pour la comparaison (voir la section @pxref{Text Representations}) de telle sorte qu'une chaîne uni-octet et sa conversion en multi-octet sont toujours considérées comme égales. Si @var{ignore-case} est non @code{nil}, alors la casse est ignorée, de sorte que les lettres majuscules peuvent être égales aux minuscules.

source: The syntax for integers in bases other than 10 uses @samp{#} followed by a letter that specifies the radix: @samp{b} for binary, @samp{o} for octal, @samp{x} for hex, or @samp{@var{radix}r} to specify radix @var{radix}. Case is not significant for the letter that specifies the radix. Thus, @samp{#b@var{integer}} reads @var{integer} in binary, and @samp{#@var{radix}r@var{integer}} reads @var{integer} in radix @var{radix}. Allowed values of @var{radix} run from 2 to 36. For example:
fr_fr: La syntaxe pour des nombres entiers dans les bases autres que la base 10 utilise @samp{#} suivi d'une lettre qui indique la base : @samp{b} pour binaire, @samp{o} pour octal, @samp{x} pour hex, ou @samp{@var{base}r} pour indiquer la base @var{base}. Le cas n'est pas significatif pour la lettre qui indique la base. Ainsi, le @samp{#b@var{integer}} lit @var{integer} en base binaire, et le @samp{#@var{base}r@var{integer}} lit @var{integer} dans la base @var{base}. Les valeurs permises de @var{base} vont de 2 à 36. Par exemple:

source: The upcase table maps each character into the corresponding upper case character.
fr_fr: La table upcase associe à chaque caractère à son caractère majuscule correspondant.

source: The value @code{-0.0} is distinguishable from ordinary zero in @acronym{IEEE} floating point, but Emacs Lisp @code{equal} and @code{=} consider them equal values.
fr_fr: La valeur @code{-0.0} est distinguable de l'ordinaire zéro dans la virgule flottante de @acronym{IEEE}, mais en Emacs Lisp @code{equal} et @code{=} sont considérés comme valeurs égales.

source: The value cell holds the symbol's value as a variable (@pxref{Variables}). That is what you get if you evaluate the symbol as a Lisp expression (@pxref{Evaluation}). Any Lisp object is a legitimate value. Certain symbols have values that cannot be changed; these include @code{nil} and @code{t}, and any symbol whose name starts with @samp{:} (those are called @dfn{keywords}). @xref{Constant Variables}.
fr_fr: La cellule de valeur contient la valeur du symbole sous forme d'une variable (@pxref{Variables}). C'est ce qu'on obtient si on évalue le symbole comme expression Lisp (@pxref{Evaluation}). Tout objet Lisp est une valeur autorisée. Certains symboles ont des valeurs qui ne peuvent pas être changées parmi lesquelles se trouvent @code{nil}, @code{t} et tout autre symbole dont le nom commence par @samp{:} (on appelle ces derniers @dfn{mot-clés}). @xref{Constant Variables}

source: The value is a newly constructed vector that is not @code{eq} to any existing vector.
fr_fr: La valeur est un vecteur nouvellement construit qui n'est @code{eq} à aucun vecteur existant.

source: The value of @code{(acos @var{arg})} is a number between 0 and
fr_fr: La valeur de @code{(acos @var{arg})} est un nombre entre 0 et

source: The value of @code{(asin @var{arg})} is a number between
fr_fr: La valeur de @code{(asin @var{arg})} est un nombre entre

source: The value of @code{(atan @var{y})} is a number between
fr_fr: La valeur de @code{(acos @var{arg})} est un nombre entre

source: The value of @var{count}, if specified, initializes the abbrev's usage-count. If @var{count} is not specified or @code{nil}, the use count is initialized to zero.
fr_fr: La valeur @var{count}, si indiquée, initialise les abréviations usage-compter. Si @var{count} n'est pas indiqué ou est @code{nil}, l'usage du compteur est initialisée à zéro.

source: The value of this variable indicates the time at which Emacs was built at the local site. It is a list of three integers, like the value of @code{current-time} (@pxref{Time of Day}).
fr_fr: La valeur de cette variable indique le moment où Emacs a été construit à l'emplacement local. C'est une liste de trois nombres entiers, comme la valeur de @code{current-time} (@pxref{Time of Day}).

source: The value of this variable is a full keymap used by Electric Command Future mode. The functions in this map allow you to edit commands you have not yet thought about executing.
fr_fr: La valeur de cette variable est une keymap employé par le mode Electric Command Future. Les fonctions dans cette map vous permettent d'éditer des commandes auxquelles vous n'avez pas avez encore pensé.

source: The value of this variable is the largest integer that Emacs Lisp can handle.
fr_fr: La valeur de cette variable est le plus grand nombre entier que Emacs Lisp peut manipuler.

source: The value of this variable is the smallest integer that Emacs Lisp can handle. It is negative.
fr_fr: La valeur de cette variable est le plus petit nombre entier que Emacs Lisp peut manipuler. Elle est négative.
